df 인덱스 다루기

행 인덱스를 정수형 인덱스로 초기화: .reset_index( )

 => 기존의 행 인덱스는 열 인덱스로 이동

In [17]:
#모듈 로딩
import pandas as pd

In [18]:
#데이터 준비
jumsu={'name':['마징가','태권V','원더우먼'],'kor':[89,100,99],'eng':[70,80,90],'math':[99,88,77]}

In [19]:
#딕셔너리 -> df
jumsudf=pd.DataFrame(jumsu)
jumsudf

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [20]:
#행 인덱스 초기화
df2=jumsudf.reset_index()
df2

   index  name  kor  eng  math
0      0   마징가   89   70    99
1      1   태권V  100   80    88
2      2  원더우먼   99   90    77

In [21]:
df2=df2.reset_index()
df2

   level_0  index  name  kor  eng  math
0        0      0   마징가   89   70    99
1        1      1   태권V  100   80    88
2        2      2  원더우먼   99   90    77

In [22]:
df2=jumsudf.reset_index()
print(df2.drop('index',axis=1))
print(df2.drop(columns='index'))

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77
   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [23]:
df2=jumsudf.reset_index(drop=True)
df2

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77